change aschii table to mermaid
